In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Mall_Customers.csv")

In [4]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [6]:
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
type(s1)

pandas.core.series.Series

In [10]:
s1=pd.Series([1,2,3,4,5] , index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
s1=pd.Series({'a':10, 'b':20, 'c':30}, index=['b','c','d','a'])
s1

b    20.0
c    30.0
d     NaN
a    10.0
dtype: float64

In [13]:
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Extracting Single Values

In [14]:
s1[3]

4

In [15]:
s1[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
s1[1::-1]

1    2
0    1
dtype: int64

In [17]:
s1[-3:]

7     8
8     9
9    10
dtype: int64

In [18]:
s1[:-3]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

# Math Operations

In [19]:
s1+5

0     6
1     7
2     8
3     9
4    10
5    11
6    12
7    13
8    14
9    15
dtype: int64

In [20]:
s2=pd.Series([10,11,12,13,14,15,16,17,18,19])
s1+s2

0    11
1    13
2    15
3    17
4    19
5    21
6    23
7    25
8    27
9    29
dtype: int64

# DataFrame Manipulations

In [21]:
df.tail()

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [22]:
df.shape

(200, 5)

In [23]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

.iloc: This is a pandas method used for integer-location based indexing to select rows and columns by their position.

0:3: This specifies the range of rows to select. It means "select rows from index 0 up to, but not including, index 3." So, rows 0, 1, and 2 are selected.

0:2: This specifies the range of columns to select. It means "select columns from index 0 up to, but not including, index 2." So, columns 0 and 1 are selected.

In [24]:
df.iloc[0:3,0:2]

   CustomerID   Genre
0           1    Male
1           2    Male
2           3  Female

In [25]:
df.loc[(5,10),("Genre","Age")]

     Genre  Age
5   Female   22
10    Male   67

In [27]:
df.drop('CustomerID',axis=1).head()

    Genre  Age  Annual Income (k$)  Spending Score (1-100)
0    Male   19                  15                      39
1    Male   21                  15                      81
2  Female   20                  16                       6
3  Female   23                  16                      77
4  Female   31                  17                      40

In [28]:
df.drop([2,4,7,9],axis=0).head(10)

    CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0            1    Male   19                  15                      39
1            2    Male   21                  15                      81
3            4  Female   23                  16                      77
5            6  Female   22                  17                      76
6            7  Female   35                  18                       6
8            9    Male   64                  19                       3
10          11    Male   67                  19                      14
11          12  Female   35                  19                      99
12          13  Female   58                  20                      15
13          14  Female   24                  20                      77

# Mean, Median, Maximum, Minimum Funtions

In [29]:
df.mean()

/var/folders/gk/c7h7qkyd3sn7d5qd8rlphgk80000gn/T/ipykernel_26284/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

CustomerID                100.50
Age                        38.85
Annual Income (k$)         60.56
Spending Score (1-100)     50.20
dtype: float64

In [30]:
df.min()

CustomerID                     1
Genre                     Female
Age                           18
Annual Income (k$)            15
Spending Score (1-100)         1
dtype: object

In [31]:
df.median()

/var/folders/gk/c7h7qkyd3sn7d5qd8rlphgk80000gn/T/ipykernel_26284/530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

CustomerID                100.5
Age                        36.0
Annual Income (k$)         61.5
Spending Score (1-100)     50.0
dtype: float64

In [33]:
df.max()

CustomerID                 200
Genre                     Male
Age                         70
Annual Income (k$)         137
Spending Score (1-100)      99
dtype: object

In [36]:
def half(s):
    return s*0.5

df[['Age','Annual Income (k$)']].apply(half).head(10)

    Age  Annual Income (k$)
0   9.5                 7.5
1  10.5                 7.5
2  10.0                 8.0
3  11.5                 8.0
4  15.5                 8.5
5  11.0                 8.5
6  17.5                 9.0
7  11.5                 9.0
8  32.0                 9.5
9  15.0                 9.5

In [37]:
def Double(s):
    return s*2

df[['Age','Annual Income (k$)']].apply(Double).head(10)

   Age  Annual Income (k$)
0   38                  30
1   42                  30
2   40                  32
3   46                  32
4   62                  34
5   44                  34
6   70                  36
7   46                  36
8  128                  38
9   60                  38

In [38]:
df['Genre'].value_counts()

Female    112
Male       88
Name: Genre, dtype: int64

In [41]:
df.sort_values(by='Spending Score (1-100)').head(10)

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
156         157    Male   37                  78                       1
158         159    Male   34                  78                       1
8             9    Male   64                  19                       3
32           33    Male   53                  33                       4
30           31    Male   60                  30                       4
162         163    Male   19                  81                       5
134         135    Male   20                  73                       5
22           23  Female   46                  25                       5
140         141  Female   57                  75                       5
2             3  Female   20                  16                       6